articles/2022/Code-highlighting-has-arrived.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Monday, 01 Aug 2022 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Feature: Code highlighting has arrived!</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/css/normalize.css" type="text/css">
       <link rel="stylesheet" href="/css/sakura.css" media="screen" />
       <link rel="stylesheet" href="/css/sakura-dark.css" media="screen and (prefers-color-scheme: dark)" />
       <link rel="stylesheet" href="/css/mine.css" type="text/css">

       <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">

       <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/styles/base16/papercolor-light.min.css" media="screen" />
       <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/styles/base16/papercolor-dark.min.css" media="screen and (prefers-color-scheme: dark)" />

       <link rel="shortcut icon" type="image/x-icon" href="/icons/icon-light.png" id="faviconTag"/>

</head>
<body>
<div id="preamble" class="status">
<b>Konstantinos Chousos</b>
       <nav>
       		<a href="/"> <i class="fa fa-home"></i> Home </a> |
       		<a href="/articles.html"> <i class="fa fa-book"></i> Articles </a> |
       		<a href="/about.html"> <i class="fa fa-user"></i> About </a> |
       		<a href="https://github.com/kchousos"> <i class="fa fa-github"></i> Github </a>
       <nav>
</div>
<div id="content">
<h1 class="title">Feature: Code highlighting has arrived!</h1>
<p>
Since this site has to do with tech and programming, it will naturally have code blocks. With my previous configuration, exported code blocks from org-mode worked just fine, except with one caveat: they weren't highlighted.
</p>

<p>
Although syntax highlighting and if it is needed can be a controversial topic where views differ, I thought that it would be a nice QOL improvement.
</p>

<p>
Normally, the <code>htmlize</code> emacs package would do the trick. But, as many other have pointed out<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup><sup>, </sup><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup><sup>, </sup><sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>, it doesn't work when emacs is run in <code>-batch</code> mode, which is necessary for the auto-publication of this site.
</p>

<p>
So my solution was to "borrow" this snippet from <a href="https://www.reddit.com/r/emacs/comments/bhlxmd/where_is_the_proper_way_of_rewriting_or_replacing/">this reddit thread</a>,Which makes the exported html <a href="https://highlightjs.org/">Highlight.js</a>-compatible.
</p>

<div class="org-src-container">
<pre><code class="lisp">(defun my/org-html-src-block (html)
  "Modify the output of org-html-src-block for highlight.js"
  (replace-regexp-in-string
   "&lt;/pre&gt;" "&lt;/code&gt;&lt;/pre&gt;"
   (replace-regexp-in-string
    "&lt;pre class=\"src src-\\(.*\\)\"&gt;"
    "&lt;pre&gt;&lt;code class=\"\\1\"&gt;"
    html)))

(advice-add 'org-html-src-block :filter-return #'my/org-html-src-block)
</code></pre>
</div>

<p>
Now, with the following html code added to my automatic build script:
</p>

<div class="org-src-container">
<pre><code class="html">&lt;!-- HTML HEAD --&gt;
&lt;link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/styles/base16/papercolor-light.min.css" media="screen"/&gt;
&lt;link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/styles/base16/papercolor-dark.min.css" media="screen and (prefers-color-scheme: dark)"/&gt;
...
&lt;!-- HTML BODY --&gt;
&lt;script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/highlight.min.js"&gt;&lt;/script&gt;
&lt;script&gt;hljs.highlightAll();&lt;/script&gt;
</code></pre>
</div>

<p>
The code blocks are highlighted based on the language's syntax. Also, in the same way the main css is changed based on whether dark-mode is enabled, the highlight.js theme is changed as well.
</p>

<div id="outline-container-org5f15f6c" class="outline-2">
<h2 id="org5f15f6c">Caveats</h2>
<div class="outline-text-2" id="text-org5f15f6c">
<p>
The only downside of this approach is that the highlighting becomes depended to whether highlight.js supports the language <del>(<i>e.g.</i>, emacs-lisp is <span class="underline">not</span> supported as the first code block indicates)</del>.
<b>Edit</b>: you can get <code>lisp</code> syntax highlighting by including the language seperately, since it's not in the common set of the main link. <code>Lisp</code> is added by the following line:
</p>

<div class="org-src-container">
<pre><code class="html">&lt;script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/languages/lisp.min.js"&gt;&lt;/script&gt;
</code></pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://stackoverflow.com/questions/22123382/running-org-export-as-html-in-emacs-batch-mode">https://stackoverflow.com/questions/22123382/running-org-export-as-html-in-emacs-batch-mode</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://emacs.stackexchange.com/questions/38437/org-mode-batch-export-missing-syntax-highlighting">https://emacs.stackexchange.com/questions/38437/org-mode-batch-export-missing-syntax-highlighting</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://stackoverflow.com/questions/24329865/using-emacs-in-batch-mode-to-dump-a-file-with-syntax-highlighting">https://stackoverflow.com/questions/24329865/using-emacs-in-batch-mode-to-dump-a-file-with-syntax-highlighting</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<hr>
       <center>
           <p>Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a>,
                        <a href="https://orgmode.org/">Org Mode</a> and
                        <a href="https://github.com/oxalorg/sakura">Sakura</a>
                        <br>Last edited: Monday, 01 Aug 2022
           </p>
       </center>

       <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/highlight.min.js"></script>
       <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/languages/lisp.min.js"></script>
       <script src="/js/my_highlight.js"></script>

       <script src="/js/favicon.js"></script>
       <script src="/js/external_links.js"></script>
</div>
</body>
</html>
